import csv
import json


total_record = 0
월별통계 = {}
통관지세관 = {}
신고인 = {}
수입자 = {}
해외거래처 = {}
특송업체 = {}
수입통관계획 = {}
수입신고구분 = {}
수입거래구분 = {}
수입종류 = {}
징수형태 = {}

운송수단유형 = {}
반입보세구역 = {}
HS10단위 = {}
적출국가 = {}
원산지국가 = {}
관세율구분 = {}
검사결과 = {}
entities = [월별통계, 통관지세관, 신고인, 수입자, 해외거래처, 특송업체, 수입통관계획, 수입신고구분,
            수입거래구분, 수입종류, 징수형태, 운송수단유형, 반입보세구역, HS10단위, 적출국가, 원산지국가, 관세율구분, 검사결과]
# for _ in 월별통계:
#     a[_+1].append(월별신고량[_])
#     a[_+1].append(월별우범량[_])
#     a[_+1].append(월별핵심적발량[_])
# print(월별통계)

# Record_Num = {}
# num = 0
with open('train.csv', 'r', encoding="utf-8") as f:
    reader = csv.reader(f)
    for line in reader:
        if line[0] == "신고번호":
            continue
        total_record += 1
        keys = []
        keys.append(line[1][5:7])
        keys.extend(line[2:12])
        keys.extend(line[14:20])
        keys.append(line[21])
        # 신고중량 = line[12]
        # 과세가격원화금액 = line[13]
        # 관세율 = line[20]

        # 통관지세관부호 = line[2]
        # 신고인부호 = line[3]
        # 수입자부호 = line[4]
        # 해외거래처부호 = line[5]
        # 특송업체부호 = line[6]
        # 수입통관계획코드 = line[7]
        # 수입신고구분코드 = line[8]
        # 수입거래구분코드 = line[9]
        # 수입종류코드 = line[10]
        # 징수형태코드 = line[11]

        # 운송수단유형코드 = line[14]
        # 반입보세구역부호 = line[15]
        # HS10단위부호 = line[16]
        # 적출국가코드 = line[17]
        # 원산지국가코드 = line[18]
        # 관세율구분코드 = line[19]

        # 검사결과코드 = line[21]
        우범여부 = line[22]
        핵심적발 = line[23]

        for _ in range(len(entities)):
            if keys[_] not in entities[_]:
                entities[_][keys[_]] = [1, 0, 0]
            else:
                entities[_][keys[_]][0] += 1

            if 우범여부 == '1':
                entities[_][keys[_]][1] += 1
            if 핵심적발 == '2':
                entities[_][keys[_]][2] += 1

        # if month not in 월별통계:
        #     월별통계[month] = [1, 0, 0]
        # else:
        #     월별통계[month][0] += 1

        # if 통관지세관부호 not in 통관지세관:
        #     통관지세관[통관지세관부호] = [1, 0, 0]
        # else:
        #     통관지세관[통관지세관부호][0] += 1

        # if 신고인부호 not in 신고인:
        #     신고인[신고인부호] = [1, 0, 0]
        # else:
        #     신고인[신고인부호][0] += 1

        # if 우범여부 == '1':
        #     월별통계[month][1] += 1
        #     통관지세관[통관지세관부호][1] += 1
        #     신고인[신고인부호][1] += 1

        # if 핵심적발 == '2':
        #     월별통계[month][2] += 1
        #     통관지세관[통관지세관부호][1] += 1
        #     신고인[신고인부호][1] += 1

        # if line[22] == '1':
        #     수입거래구분코드_우범[line[9]] += 1
        # if line[23] == '2':
        #     수입거래구분코드_핵심적발[line[9]] += 1
        # 수입거래구분코드[line[9]] += 1

info = {}
# {"entity":[총신고량, 우범량, 핵심적발량]}
info["월별통계"] = 월별통계
info["통관지세관"] = 통관지세관
info["신고인"] = 신고인
info["수입자"] = 수입자
info["해외거래처"] = 해외거래처
info["특송업체"] = 특송업체
info["수입통관계획"] = 수입통관계획
info["수입신고구분"] = 수입신고구분
info["수입거래구분"] = 수입거래구분
info["수입종류"] = 수입종류
info["징수형태"] = 징수형태
info["운송수단유형"] = 운송수단유형
info["반입보세구역"] = 반입보세구역
info["HS10단위"] = HS10단위
info["적출국가"] = 적출국가
info["원산지국가"] = 원산지국가
info["관세율구분"] = 관세율구분
info["검사결과"] = 검사결과

# # 전체신고량 = 89355
# info["전체신고량"] = total_record
# # {"01":[총신고량, 우범량, 핵심적발량, 우범률, 핵심적발률], "02":[...], ...}
# info["월별통계"] = 월별통계
# # {"통관지세관부호":[총신고량, 우범량, 핵심적발량, 우범률, 핵심적발률]}
# info["통관지세관"] = 통관지세관
# # 통관지세관수 =
# info["통관지세관수"] = len(통관지세관)
# # {"신고인부호": [총신고량, 우범량, 핵심적발량, 우범률, 핵심적발률]}
# info["신고인"] = 신고인
# # 신고인수 = 965
# info["신고인수"] = len(신고인)


with open("test.json", "w", encoding="utf-8") as make_file:
    json.dump(info, make_file, indent="\t")

with open("test.json", "r", encoding="utf-8") as f:
    json_data = json.load(f)
    print(json_data)
#     print(수입거래구분코드)
#     print(수입거래구분코드_우범)
#     print(수입거래구분코드_핵심적발)


# 전체물류량 = 89355

# # {"01":신고량, 우범량, 핵심적발량, 우범률, 핵심적발률], "02":[...], ...}
# 월별통계 = {'01': [10312, 2200, 1108, 21.33, 10.74], '02': [8910, 2018, 1058, 22.65, 11.87], '03': [9351, 2091, 1052, 22.36, 11.25], '04': [7867, 1905, 957, 24.22, 12.16],
#         '05': [8034, 1834, 969, 22.83, 12.06], '06': [7977, 1881, 1016, 23.58, 12.74], '07': [8673, 2026, 1005, 23.36, 11.59], '08': [7888, 1793, 930, 22.73, 11.79],
#         '09': [7735, 1807, 948, 23.36, 12.26], '10': [7183, 1708, 875, 23.78, 12.18], '11': [5425, 1297, 663, 23.91, 12.22], '12': [0, 0, 0, 0.0, 0.0]}

# 신고인수 = 965
# 수입자수 = 8417
# 해외거래처수 = 4778
# 특송업체수 = 80


# # '코드': [총량, 우범량, 핵심적발량]
# 수입통관계획코드 = {'B': [6863, 1060, 460], 'C': [31771, 6687, 3402], 'D': [32498, 6651, 3446],
#             'E': [6355, 2132, 1089], 'F': [9656, 2945, 1582], 'H': [260, 172, 87], 'Z': [1952, 913, 515]}

# # '코드': [총량, 우범량, 핵심적발량]
# 수입신고구분코드 = {'A': [966, 156, 78], 'B': [84125, 18267, 9346],
#             'D': [2422, 1208, 650], 'E': [1842, 929, 507]}

# # '코드': [총량, 우범량, 핵심적발량]
# 수입거래구분코드 = {'11': [48522, 8238, 4148], '12': [51, 28, 20], '13': [71, 52, 28], '15': [25144, 5864, 2995], '21': [51, 34, 18], '22': [78, 53, 28], '29': [275, 141, 90], '51': [56, 35, 17],
#             '52': [51, 38, 21], '55': [35, 17, 7], '59': [51, 31, 22], '71': [86, 53, 25], '80': [124, 71, 34], '83': [237, 143, 79], '84': [286, 187, 89], '85': [218, 130, 73], '86': [118, 68, 42], '87': [4094, 1541, 809], '88': [255, 155, 89], '89': [399, 234, 117], '91': [3586, 1251, 664], '92': [142, 88, 50], '93': [268, 157, 96], '94': [4905, 1800, 941], '96': [252, 151, 79]}
